Tekla Open API Reference for Tekla Structures 2025
StraightDimension.GetDimensionSet Method
Overload List
Name | Description
GetDimensionSet()
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet().)
GetDimensionSet(Boolean)
 Gets the dimension set the current dimension belongs to.
 (Overrides DimensionBase.GetDimensionSet(Boolean).)
Top
See Also
Reference
StraightDimension Class
Tekla.Structures.Drawing Namespace